{"weightsManifest": [{"weights": [{"dtype": "float32", "name": "dense_1/kernel", "shape": [1024, 6]}, {"dtype": "float32", "name": "dense_1/bias", "shape": [6]}, {"dtype": "float32", "name": "conv_pw_13/kernel", "shape": [1, 1, 1024, 1024]}, {"dtype": "float32", "name": "conv_pw_13_bn/gamma", "shape": [1024]}, {"dtype": "float32", "name": "conv_pw_13_bn/beta", "shape": [1024]}, {"dtype": "float32", "name": "conv1/kernel", "shape": [3, 3, 3, 32]}, {"dtype": "float32", "name": "conv1_bn/gamma", "shape": [32]}, {"dtype": "float32", "name": "conv1_bn/beta", "shape": [32]}, {"dtype": "float32", "name": "conv1_bn/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "conv1_bn/moving_variance", "shape": [32]}, {"dtype": "float32", "name": "conv_dw_1/depthwise_kernel", "shape": [3, 3, 32, 1]}, {"dtype": "float32", "name": "conv_dw_1_bn/gamma", "shape": [32]}, {"dtype": "float32", "name": "conv_dw_1_bn/beta", "shape": [32]}, {"dtype": "float32", "name": "conv_dw_1_bn/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "conv_dw_1_bn/moving_variance", "shape": [32]}, {"dtype": "float32", "name": "conv_pw_1/kernel", "shape": [1, 1, 32, 64]}, {"dtype": "float32", "name": "conv_pw_1_bn/gamma", "shape": [64]}, {"dtype": "float32", "name": "conv_pw_1_bn/beta", "shape": [64]}, {"dtype": "float32", "name": "conv_pw_1_bn/moving_mean", "shape": [64]}, {"dtype": "float32", "name": "conv_pw_1_bn/moving_variance", "shape": [64]}, {"dtype": "float32", "name": "conv_dw_2/depthwise_kernel", "shape": [3, 3, 64, 1]}, {"dtype": "float32", "name": "conv_dw_2_bn/gamma", "shape": [64]}, {"dtype": "float32", "name": "conv_dw_2_bn/beta", "shape": [64]}, {"dtype": "float32", "name": "conv_dw_2_bn/moving_mean", "shape": [64]}, {"dtype": "float32", "name": "conv_dw_2_bn/moving_variance", "shape": [64]}, {"dtype": "float32", "name": "conv_pw_2/kernel", "shape": [1, 1, 64, 128]}, {"dtype": "float32", "name": "conv_pw_2_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv_pw_2_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv_pw_2_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv_pw_2_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_3/depthwise_kernel", "shape": [3, 3, 128, 1]}, {"dtype": "float32", "name": "conv_dw_3_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_3_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_3_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_3_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv_pw_3/kernel", "shape": [1, 1, 128, 128]}, {"dtype": "float32", "name": "conv_pw_3_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv_pw_3_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv_pw_3_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv_pw_3_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_4/depthwise_kernel", "shape": [3, 3, 128, 1]}, {"dtype": "float32", "name": "conv_dw_4_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_4_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_4_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv_dw_4_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv_pw_4/kernel", "shape": [1, 1, 128, 256]}, {"dtype": "float32", "name": "conv_pw_4_bn/gamma", "shape": [256]}, {"dtype": "float32", "name": "conv_pw_4_bn/beta", "shape": [256]}, {"dtype": "float32", "name": "conv_pw_4_bn/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "conv_pw_4_bn/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_5/depthwise_kernel", "shape": [3, 3, 256, 1]}, {"dtype": "float32", "name": "conv_dw_5_bn/gamma", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_5_bn/beta", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_5_bn/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_5_bn/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "conv_pw_5/kernel", "shape": [1, 1, 256, 256]}, {"dtype": "float32", "name": "conv_pw_5_bn/gamma", "shape": [256]}, {"dtype": "float32", "name": "conv_pw_5_bn/beta", "shape": [256]}, {"dtype": "float32", "name": "conv_pw_5_bn/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "conv_pw_5_bn/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_6/depthwise_kernel", "shape": [3, 3, 256, 1]}, {"dtype": "float32", "name": "conv_dw_6_bn/gamma", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_6_bn/beta", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_6_bn/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "conv_dw_6_bn/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "conv_pw_6/kernel", "shape": [1, 1, 256, 512]}, {"dtype": "float32", "name": "conv_pw_6_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_6_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_6_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_6_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_7/depthwise_kernel", "shape": [3, 3, 512, 1]}, {"dtype": "float32", "name": "conv_dw_7_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_7_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_7_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_7_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_7/kernel", "shape": [1, 1, 512, 512]}, {"dtype": "float32", "name": "conv_pw_7_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_7_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_7_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_7_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_8/depthwise_kernel", "shape": [3, 3, 512, 1]}, {"dtype": "float32", "name": "conv_dw_8_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_8_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_8_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_8_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_8/kernel", "shape": [1, 1, 512, 512]}, {"dtype": "float32", "name": "conv_pw_8_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_8_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_8_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_8_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_9/depthwise_kernel", "shape": [3, 3, 512, 1]}, {"dtype": "float32", "name": "conv_dw_9_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_9_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_9_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_9_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_9/kernel", "shape": [1, 1, 512, 512]}, {"dtype": "float32", "name": "conv_pw_9_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_9_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_9_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_9_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_10/depthwise_kernel", "shape": [3, 3, 512, 1]}, {"dtype": "float32", "name": "conv_dw_10_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_10_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_10_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_10_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_10/kernel", "shape": [1, 1, 512, 512]}, {"dtype": "float32", "name": "conv_pw_10_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_10_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_10_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_10_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_11/depthwise_kernel", "shape": [3, 3, 512, 1]}, {"dtype": "float32", "name": "conv_dw_11_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_11_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_11_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_11_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_11/kernel", "shape": [1, 1, 512, 512]}, {"dtype": "float32", "name": "conv_pw_11_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_11_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_11_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_11_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_12/depthwise_kernel", "shape": [3, 3, 512, 1]}, {"dtype": "float32", "name": "conv_dw_12_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_12_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_12_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv_dw_12_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "conv_pw_12/kernel", "shape": [1, 1, 512, 1024]}, {"dtype": "float32", "name": "conv_pw_12_bn/gamma", "shape": [1024]}, {"dtype": "float32", "name": "conv_pw_12_bn/beta", "shape": [1024]}, {"dtype": "float32", "name": "conv_pw_12_bn/moving_mean", "shape": [1024]}, {"dtype": "float32", "name": "conv_pw_12_bn/moving_variance", "shape": [1024]}, {"dtype": "float32", "name": "conv_dw_13/depthwise_kernel", "shape": [3, 3, 1024, 1]}, {"dtype": "float32", "name": "conv_dw_13_bn/gamma", "shape": [1024]}, {"dtype": "float32", "name": "conv_dw_13_bn/beta", "shape": [1024]}, {"dtype": "float32", "name": "conv_dw_13_bn/moving_mean", "shape": [1024]}, {"dtype": "float32", "name": "conv_dw_13_bn/moving_variance", "shape": [1024]}, {"dtype": "float32", "name": "conv_pw_13_bn/moving_mean", "shape": [1024]}, {"dtype": "float32", "name": "conv_pw_13_bn/moving_variance", "shape": [1024]}], "paths": ["group1-shard1of4", "group1-shard2of4", "group1-shard3of4", "group1-shard4of4"]}], "modelTopology": {"backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "name": "input_1", "sparse": false}, "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[0, 1], [0, 1]], "trainable": false, "name": "conv1_pad"}, "name": "conv1_pad"}, {"inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "filters": 32, "data_format": "channels_last", "name": "conv1", "activation": "linear", "strides": [2, 2], "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "bias_regularizer": null, "trainable": false, "kernel_size": [3, 3]}, "name": "conv1"}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_constraint": null, "beta_regularizer": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "conv1_bn", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "name": "conv1_bn"}, {"inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"negative_slope": 0.0, "max_value": 6.0, "threshold": 0.0, "trainable": false, "name": "conv1_relu"}, "name": "conv1_relu"}, {"inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"activity_regularizer": null, "padding": "same", "depthwise_constraint": null, "use_bias": false, "bias_constraint": null, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "name": "conv_dw_1", "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "bias_regularizer": null, "trainable": false, "depth_multiplier": 1}, "name": "conv_dw_1"}, {"inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_constraint": null, "beta_regularizer": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "conv_dw_1_bn", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "name": "conv_dw_1_bn"}, {"inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"negative_slope": 0.0, "max_value": 6.0, "threshold": 0.0, "trainable": false, "name": "conv_dw_1_relu"}, "name": "conv_dw_1_relu"}, {"inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "filters": 64, "data_format": "channels_last", "name": "conv_pw_1", "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "bias_regularizer": null, "trainable": false, "kernel_size": [1, 1]}, "name": "conv_pw_1"}, {"inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_constraint": null, "beta_regularizer": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "conv_pw_1_bn", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "name": "conv_pw_1_bn"}, {"inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"negative_slope": 0.0, "max_value": 6.0, "threshold": 0.0, "trainable": false, "name": "conv_pw_1_relu"}, "name": "conv_pw_1_relu"}, {"inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[0, 1], [0, 1]], "trainable": false, "name": "conv_pad_2"}, "name": "conv_pad_2"}, {"inbound_nodes": [[["conv_pad_2", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"activity_regularizer": null, "padding": "valid", "depthwise_constraint": null, "use_bias": false, "bias_constraint": null, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "name": "conv_dw_2", "activation": "linear", "strides": [2, 2], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "bias_regularizer": null, "trainable": false, "depth_multiplier": 1}, "name": "conv_dw_2"}, {"inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_constraint": null, "beta_regularizer": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "conv_dw_2_bn", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "name": "conv_dw_2_bn"}, {"inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"negative_slope": 0.0, "max_value": 6.0, "threshold": 0.0, "trainable": false, "name": "conv_dw_2_relu"}, "name": "conv_dw_2_relu"}, {"inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "filters": 128, "data_format": "channels_last", "name": "conv_pw_2", "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "bias_regularizer": null, "trainable": false, "kernel_size": [1, 1]}, "name": "conv_pw_2"}, {"inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_constraint": null, "beta_regularizer": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "conv_pw_2_bn", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "name": "conv_pw_2_bn"}, {"inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"negative_slope": 0.0, "max_value": 6.0, "threshold": 0.0, "trainable": false, "name": "conv_pw_2_relu"}, "name": "conv_pw_2_relu"}, {"inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"activity_regularizer": null, "padding": "same", "depthwise_constraint": null, "use_bias": false, "bias_constraint": null, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "name": "conv_dw_3", "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "bias_regularizer": null, "trainable": false, "depth_multiplier": 1}, "name": "conv_dw_3"}, {"inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_constraint": null, "beta_regularizer": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "conv_dw_3_bn", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "name": "conv_dw_3_bn"}, {"inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"negative_slope": 0.0, "max_value": 6.0, "threshold": 0.0, "trainable": false, "name": "conv_dw_3_relu"}, "name": "conv_dw_3_relu"}, {"inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "filters": 128, "data_format": "channels_last", "name": "conv_pw_3", "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "bias_regularizer": null, "trainable": false, "kernel_size": [1, 1]}, "name": "conv_pw_3"}, {"inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_constraint": null, "beta_regularizer": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "conv_pw_3_bn", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "name": "conv_pw_3_bn"}, {"inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"negative_slope": 0.0, "max_value": 6.0, "threshold": 0.0, "trainable": false, "name": "conv_pw_3_relu"}, "name": "conv_pw_3_relu"}, {"inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[0, 1], [0, 1]], "trainable": false, "name": "conv_pad_4"}, "name": "conv_pad_4"}, {"inbound_nodes": [[["conv_pad_4", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"activity_regularizer": null, "padding": "valid", "depthwise_constraint": null, "use_bias": false, "bias_constraint": null, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "name": "conv_dw_4", "activation": "linear", "strides": [2, 2], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "bias_regularizer": null, "trainable": false, "depth_multiplier": 1}, "name": "conv_dw_4"}, {"inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_constraint": null, "beta_regularizer": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "conv_dw_4_bn", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "name": "conv_dw_4_bn"}, {"inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"negative_slope": 0.0, "max_value": 6.0, "threshold": 0.0, "trainable": false, "name": "conv_dw_4_relu"}, "name": "conv_dw_4_relu"}, {"inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "filters": 256, "data_format": "channels_last", "name": "conv_pw_4", "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "bias_regularizer": null, "trainable": false, "kernel_size": [1, 1]}, "name": "conv_pw_4"}, {"inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_constraint": null, "beta_regularizer": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "conv_pw_4_bn", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "name": "conv_pw_4_bn"}, {"inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"negative_slope": 0.0, "max_value": 6.0, "threshold": 0.0, "trainable": false, "name": "conv_pw_4_relu"}, "name": "conv_pw_4_relu"}, {"inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"activity_regularizer": null, "padding": "same", "depthwise_constraint": null, "use_bias": false, "bias_constraint": null, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "name": "conv_dw_5", "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "bias_regularizer": null, "trainable": false, "depth_multiplier": 1}, "name": "conv_dw_5"}, {"inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_constraint": null, "beta_regularizer": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "conv_dw_5_bn", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "name": "conv_dw_5_bn"}, {"inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"negative_slope": 0.0, "max_value": 6.0, "threshold": 0.0, "trainable": false, "name": "conv_dw_5_relu"}, "name": "conv_dw_5_relu"}, {"inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "filters": 256, "data_format": "channels_last", "name": "conv_pw_5", "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "bias_regularizer": null, "trainable": false, "kernel_size": [1, 1]}, "name": "conv_pw_5"}, {"inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_constraint": null, "beta_regularizer": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "conv_pw_5_bn", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "name": "conv_pw_5_bn"}, {"inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"negative_slope": 0.0, "max_value": 6.0, "threshold": 0.0, "trainable": false, "name": "conv_pw_5_relu"}, "name": "conv_pw_5_relu"}, {"inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[0, 1], [0, 1]], "trainable": false, "name": "conv_pad_6"}, "name": "conv_pad_6"}, {"inbound_nodes": [[["conv_pad_6", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"activity_regularizer": null, "padding": "valid", "depthwise_constraint": null, "use_bias": false, "bias_constraint": null, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "name": "conv_dw_6", "activation": "linear", "strides": [2, 2], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "bias_regularizer": null, "trainable": false, "depth_multiplier": 1}, "name": "conv_dw_6"}, {"inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_constraint": null, "beta_regularizer": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "conv_dw_6_bn", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "name": "conv_dw_6_bn"}, {"inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"negative_slope": 0.0, "max_value": 6.0, "threshold": 0.0, "trainable": false, "name": "conv_dw_6_relu"}, "name": "conv_dw_6_relu"}, {"inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "filters": 512, "data_format": "channels_last", "name": "conv_pw_6", "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "bias_regularizer": null, "trainable": false, "kernel_size": [1, 1]}, "name": "conv_pw_6"}, {"inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_constraint": null, "beta_regularizer": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "conv_pw_6_bn", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "name": "conv_pw_6_bn"}, {"inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"negative_slope": 0.0, "max_value": 6.0, "threshold": 0.0, "trainable": false, "name": "conv_pw_6_relu"}, "name": "conv_pw_6_relu"}, {"inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"activity_regularizer": null, "padding": "same", "depthwise_constraint": null, "use_bias": false, "bias_constraint": null, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "name": "conv_dw_7", "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "bias_regularizer": null, "trainable": false, "depth_multiplier": 1}, "name": "conv_dw_7"}, {"inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_constraint": null, "beta_regularizer": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "conv_dw_7_bn", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "name": "conv_dw_7_bn"}, {"inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"negative_slope": 0.0, "max_value": 6.0, "threshold": 0.0, "trainable": false, "name": "conv_dw_7_relu"}, "name": "conv_dw_7_relu"}, {"inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "filters": 512, "data_format": "channels_last", "name": "conv_pw_7", "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "bias_regularizer": null, "trainable": false, "kernel_size": [1, 1]}, "name": "conv_pw_7"}, {"inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_constraint": null, "beta_regularizer": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "conv_pw_7_bn", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "name": "conv_pw_7_bn"}, {"inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"negative_slope": 0.0, "max_value": 6.0, "threshold": 0.0, "trainable": false, "name": "conv_pw_7_relu"}, "name": "conv_pw_7_relu"}, {"inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"activity_regularizer": null, "padding": "same", "depthwise_constraint": null, "use_bias": false, "bias_constraint": null, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "name": "conv_dw_8", "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "bias_regularizer": null, "trainable": false, "depth_multiplier": 1}, "name": "conv_dw_8"}, {"inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_constraint": null, "beta_regularizer": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "conv_dw_8_bn", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "name": "conv_dw_8_bn"}, {"inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"negative_slope": 0.0, "max_value": 6.0, "threshold": 0.0, "trainable": false, "name": "conv_dw_8_relu"}, "name": "conv_dw_8_relu"}, {"inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "filters": 512, "data_format": "channels_last", "name": "conv_pw_8", "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "bias_regularizer": null, "trainable": false, "kernel_size": [1, 1]}, "name": "conv_pw_8"}, {"inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_constraint": null, "beta_regularizer": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "conv_pw_8_bn", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "name": "conv_pw_8_bn"}, {"inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"negative_slope": 0.0, "max_value": 6.0, "threshold": 0.0, "trainable": false, "name": "conv_pw_8_relu"}, "name": "conv_pw_8_relu"}, {"inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"activity_regularizer": null, "padding": "same", "depthwise_constraint": null, "use_bias": false, "bias_constraint": null, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "name": "conv_dw_9", "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "bias_regularizer": null, "trainable": false, "depth_multiplier": 1}, "name": "conv_dw_9"}, {"inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_constraint": null, "beta_regularizer": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "conv_dw_9_bn", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "name": "conv_dw_9_bn"}, {"inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"negative_slope": 0.0, "max_value": 6.0, "threshold": 0.0, "trainable": false, "name": "conv_dw_9_relu"}, "name": "conv_dw_9_relu"}, {"inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "filters": 512, "data_format": "channels_last", "name": "conv_pw_9", "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "bias_regularizer": null, "trainable": false, "kernel_size": [1, 1]}, "name": "conv_pw_9"}, {"inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_constraint": null, "beta_regularizer": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "conv_pw_9_bn", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "name": "conv_pw_9_bn"}, {"inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"negative_slope": 0.0, "max_value": 6.0, "threshold": 0.0, "trainable": false, "name": "conv_pw_9_relu"}, "name": "conv_pw_9_relu"}, {"inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"activity_regularizer": null, "padding": "same", "depthwise_constraint": null, "use_bias": false, "bias_constraint": null, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "name": "conv_dw_10", "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "bias_regularizer": null, "trainable": false, "depth_multiplier": 1}, "name": "conv_dw_10"}, {"inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_constraint": null, "beta_regularizer": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "conv_dw_10_bn", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "name": "conv_dw_10_bn"}, {"inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"negative_slope": 0.0, "max_value": 6.0, "threshold": 0.0, "trainable": false, "name": "conv_dw_10_relu"}, "name": "conv_dw_10_relu"}, {"inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "filters": 512, "data_format": "channels_last", "name": "conv_pw_10", "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "bias_regularizer": null, "trainable": false, "kernel_size": [1, 1]}, "name": "conv_pw_10"}, {"inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_constraint": null, "beta_regularizer": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "conv_pw_10_bn", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "name": "conv_pw_10_bn"}, {"inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"negative_slope": 0.0, "max_value": 6.0, "threshold": 0.0, "trainable": false, "name": "conv_pw_10_relu"}, "name": "conv_pw_10_relu"}, {"inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"activity_regularizer": null, "padding": "same", "depthwise_constraint": null, "use_bias": false, "bias_constraint": null, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "name": "conv_dw_11", "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "bias_regularizer": null, "trainable": false, "depth_multiplier": 1}, "name": "conv_dw_11"}, {"inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_constraint": null, "beta_regularizer": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "conv_dw_11_bn", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "name": "conv_dw_11_bn"}, {"inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"negative_slope": 0.0, "max_value": 6.0, "threshold": 0.0, "trainable": false, "name": "conv_dw_11_relu"}, "name": "conv_dw_11_relu"}, {"inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "filters": 512, "data_format": "channels_last", "name": "conv_pw_11", "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "bias_regularizer": null, "trainable": false, "kernel_size": [1, 1]}, "name": "conv_pw_11"}, {"inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_constraint": null, "beta_regularizer": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "conv_pw_11_bn", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "name": "conv_pw_11_bn"}, {"inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"negative_slope": 0.0, "max_value": 6.0, "threshold": 0.0, "trainable": false, "name": "conv_pw_11_relu"}, "name": "conv_pw_11_relu"}, {"inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[0, 1], [0, 1]], "trainable": false, "name": "conv_pad_12"}, "name": "conv_pad_12"}, {"inbound_nodes": [[["conv_pad_12", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"activity_regularizer": null, "padding": "valid", "depthwise_constraint": null, "use_bias": false, "bias_constraint": null, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "name": "conv_dw_12", "activation": "linear", "strides": [2, 2], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "bias_regularizer": null, "trainable": false, "depth_multiplier": 1}, "name": "conv_dw_12"}, {"inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_constraint": null, "beta_regularizer": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "conv_dw_12_bn", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "name": "conv_dw_12_bn"}, {"inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"negative_slope": 0.0, "max_value": 6.0, "threshold": 0.0, "trainable": false, "name": "conv_dw_12_relu"}, "name": "conv_dw_12_relu"}, {"inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "filters": 1024, "data_format": "channels_last", "name": "conv_pw_12", "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "bias_regularizer": null, "trainable": false, "kernel_size": [1, 1]}, "name": "conv_pw_12"}, {"inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_constraint": null, "beta_regularizer": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "conv_pw_12_bn", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "name": "conv_pw_12_bn"}, {"inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"negative_slope": 0.0, "max_value": 6.0, "threshold": 0.0, "trainable": false, "name": "conv_pw_12_relu"}, "name": "conv_pw_12_relu"}, {"inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"activity_regularizer": null, "padding": "same", "depthwise_constraint": null, "use_bias": false, "bias_constraint": null, "kernel_size": [3, 3], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "name": "conv_dw_13", "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "bias_regularizer": null, "trainable": false, "depth_multiplier": 1}, "name": "conv_dw_13"}, {"inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "beta_constraint": null, "beta_regularizer": null, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "conv_dw_13_bn", "scale": true, "epsilon": 