{"modelTopology": {"model_config": {"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "embedding_1_input", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "embedding_1_input", "batch_input_shape": [null, 40], "dtype": "float32", "sparse": false}}, {"name": "embedding_1", "class_name": "Embedding", "inbound_nodes": [[["embedding_1_input", 0, 0, {}]]], "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "dtype": "float32", "mask_zero": false, "embeddings_regularizer": null, "trainable": true, "input_dim": 5997, "name": "embedding_1", "batch_input_shape": [null, 40], "input_length": 40, "embeddings_constraint": null, "activity_regularizer": null, "output_dim": 128}}, {"name": "dense_1_input", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "dense_1_input", "batch_input_shape": [null, 2048], "dtype": "float32", "sparse": false}}, {"name": "lstm_1", "class_name": "LSTM", "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "config": {"implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "unit_forget_bias": true, "stateful": false, "trainable": true, "recurrent_constraint": null, "recurrent_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "units": 256, "unroll": false, "name": "lstm_1", "return_state": false, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "use_bias": true, "return_sequences": true, "activity_regularizer": null, "dropout": 0.0, "bias_constraint": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["dense_1_input", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dtype": "float32", "units": 128, "trainable": true, "kernel_constraint": null, "name": "dense_1", "batch_input_shape": [null, 2048], "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": true}}, {"name": "time_distributed_1", "class_name": "TimeDistributed", "inbound_nodes": [[["lstm_1", 0, 0, {}]]], "config": {"name": "time_distributed_1", "layer": {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "trainable": true, "name": "dense_2", "activation": "linear", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}}, "trainable": true}}, {"name": "repeat_vector_1", "class_name": "RepeatVector", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"name": "repeat_vector_1", "n": 40, "trainable": true}}, {"name": "concatenate_1", "class_name": "Concatenate", "inbound_nodes": [[["time_distributed_1", 0, 0, {}], ["repeat_vector_1", 0, 0, {}]]], "config": {"name": "concatenate_1", "trainable": true, "axis": -1}}, {"name": "lstm_2", "class_name": "LSTM", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "unit_forget_bias": true, "stateful": false, "trainable": true, "recurrent_constraint": null, "recurrent_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "units": 128, "unroll": false, "name": "lstm_2", "return_state": false, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "use_bias": true, "return_sequences": true, "activity_regularizer": null, "dropout": 0.0, "bias_constraint": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"name": "lstm_3", "class_name": "LSTM", "inbound_nodes": [[["lstm_2", 0, 0, {}]]], "config": {"implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "unit_forget_bias": true, "stateful": false, "trainable": true, "recurrent_constraint": null, "recurrent_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "units": 512, "unroll": false, "name": "lstm_3", "return_state": false, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "use_bias": true, "return_sequences": false, "activity_regularizer": null, "dropout": 0.0, "bias_constraint": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["lstm_3", 0, 0, {}]]], "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5997, "trainable": true, "name": "dense_3", "activation": "linear", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "use_bias": true}}, {"name": "activation_50", "class_name": "Activation", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"name": "activation_50", "activation": "softmax", "trainable": true}}], "input_layers": [["dense_1_input", 0, 0], ["embedding_1_input", 0, 0]], "output_layers": [["activation_50", 0, 0]]}}, "backend": "tensorflow", "training_config": {"loss": "categorical_crossentropy", "loss_weights": null, "sample_weight_mode": null, "metrics": ["accuracy"], "optimizer_config": {"class_name": "RMSprop", "config": {"epsilon": 1e-07, "decay": 0.0, "rho": 0.8999999761581421, "lr": 0.0010000000474974513}}}, "keras_version": "2.2.4"}, "weightsManifest": [{"weights": [{"name": "dense_1/kernel", "shape": [2048, 128], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [512, 5997], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [5997], "dtype": "float32"}, {"name": "embedding_1/embeddings", "shape": [5997, 128], "dtype": "float32"}, {"name": "lstm_1/kernel", "shape": [128, 1024], "dtype": "float32"}, {"name": "lstm_1/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "lstm_1/bias", "shape": [1024], "dtype": "float32"}, {"name": "lstm_2/kernel", "shape": [256, 512], "dtype": "float32"}, {"name": "lstm_2/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_2/bias", "shape": [512], "dtype": "float32"}, {"name": "lstm_3/kernel", "shape": [128, 2048], "dtype": "float32"}, {"name": "lstm_3/recurrent_kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "lstm_3/bias", "shape": [2048], "dtype": "float32"}, {"name": "time_distributed_1/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "time_distributed_1/bias", "shape": [128], "dtype": "float32"}], "paths": ["group1-shard1of6", "group1-shard2of6", "group1-shard3of6", "group1-shard4of6", "group1-shard5of6", "group1-shard6of6"]}]}