{"modelTopology": {"training_config": {"loss": "categorical_crossentropy", "metrics": ["accuracy"], "optimizer_config": {"config": {"decay": 0.009999999776482582, "nesterov": false, "lr": 0.10000000149011612, "momentum": 0.800000011920929}, "class_name": "SGD"}, "loss_weights": null, "sample_weight_mode": null}, "model_config": {"config": {"name": "sequential_1", "layers": [{"config": {"name": "mobilenet_1.00_224", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "config": {"sparse": false, "name": "input_1", "dtype": "float32", "batch_input_shape": [null, 224, 224, 3]}, "class_name": "InputLayer"}, {"name": "conv1_pad", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "conv1_pad", "padding": [[0, 1], [0, 1]], "data_format": "channels_last", "trainable": false}, "class_name": "ZeroPadding2D"}, {"name": "conv1", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv1", "data_format": "channels_last", "activity_regularizer": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "bias_constraint": null, "filters": 32, "kernel_constraint": null, "activation": "linear", "strides": [2, 2], "trainable": false, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"name": "conv1_bn", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv1_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv1_relu", "inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv1_relu", "threshold": 0.0, "max_value": 6.0, "trainable": false}, "class_name": "ReLU"}, {"name": "conv_dw_1", "inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv_dw_1", "data_format": "channels_last", "depthwise_regularizer": null, "activity_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "depth_multiplier": 1, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "trainable": false, "bias_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_1_bn", "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv_dw_1_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv_dw_1_relu", "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv_dw_1_relu", "threshold": 0.0, "max_value": 6.0, "trainable": false}, "class_name": "ReLU"}, {"name": "conv_pw_1", "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv_pw_1", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "bias_constraint": null, "filters": 64, "kernel_constraint": null, "activation": "linear", "strides": [1, 1], "trainable": false, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"name": "conv_pw_1_bn", "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv_pw_1_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv_pw_1_relu", "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv_pw_1_relu", "threshold": 0.0, "max_value": 6.0, "trainable": false}, "class_name": "ReLU"}, {"name": "conv_pad_2", "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "config": {"name": "conv_pad_2", "padding": [[0, 1], [0, 1]], "data_format": "channels_last", "trainable": false}, "class_name": "ZeroPadding2D"}, {"name": "conv_dw_2", "inbound_nodes": [[["conv_pad_2", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv_dw_2", "data_format": "channels_last", "depthwise_regularizer": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "depth_multiplier": 1, "bias_constraint": null, "activation": "linear", "strides": [2, 2], "trainable": false, "bias_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_2_bn", "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv_dw_2_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv_dw_2_relu", "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv_dw_2_relu", "threshold": 0.0, "max_value": 6.0, "trainable": false}, "class_name": "ReLU"}, {"name": "conv_pw_2", "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv_pw_2", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "bias_constraint": null, "filters": 128, "kernel_constraint": null, "activation": "linear", "strides": [1, 1], "trainable": false, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"name": "conv_pw_2_bn", "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv_pw_2_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv_pw_2_relu", "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv_pw_2_relu", "threshold": 0.0, "max_value": 6.0, "trainable": false}, "class_name": "ReLU"}, {"name": "conv_dw_3", "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv_dw_3", "data_format": "channels_last", "depthwise_regularizer": null, "activity_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "depth_multiplier": 1, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "trainable": false, "bias_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_3_bn", "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv_dw_3_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv_dw_3_relu", "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv_dw_3_relu", "threshold": 0.0, "max_value": 6.0, "trainable": false}, "class_name": "ReLU"}, {"name": "conv_pw_3", "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv_pw_3", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "bias_constraint": null, "filters": 128, "kernel_constraint": null, "activation": "linear", "strides": [1, 1], "trainable": false, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"name": "conv_pw_3_bn", "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv_pw_3_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv_pw_3_relu", "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv_pw_3_relu", "threshold": 0.0, "max_value": 6.0, "trainable": false}, "class_name": "ReLU"}, {"name": "conv_pad_4", "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "config": {"name": "conv_pad_4", "padding": [[0, 1], [0, 1]], "data_format": "channels_last", "trainable": false}, "class_name": "ZeroPadding2D"}, {"name": "conv_dw_4", "inbound_nodes": [[["conv_pad_4", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv_dw_4", "data_format": "channels_last", "depthwise_regularizer": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "depth_multiplier": 1, "bias_constraint": null, "activation": "linear", "strides": [2, 2], "trainable": false, "bias_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_4_bn", "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv_dw_4_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv_dw_4_relu", "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv_dw_4_relu", "threshold": 0.0, "max_value": 6.0, "trainable": false}, "class_name": "ReLU"}, {"name": "conv_pw_4", "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv_pw_4", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "bias_constraint": null, "filters": 256, "kernel_constraint": null, "activation": "linear", "strides": [1, 1], "trainable": false, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"name": "conv_pw_4_bn", "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv_pw_4_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv_pw_4_relu", "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv_pw_4_relu", "threshold": 0.0, "max_value": 6.0, "trainable": false}, "class_name": "ReLU"}, {"name": "conv_dw_5", "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv_dw_5", "data_format": "channels_last", "depthwise_regularizer": null, "activity_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "depth_multiplier": 1, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "trainable": false, "bias_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_5_bn", "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv_dw_5_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv_dw_5_relu", "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv_dw_5_relu", "threshold": 0.0, "max_value": 6.0, "trainable": false}, "class_name": "ReLU"}, {"name": "conv_pw_5", "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv_pw_5", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "bias_constraint": null, "filters": 256, "kernel_constraint": null, "activation": "linear", "strides": [1, 1], "trainable": false, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"name": "conv_pw_5_bn", "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv_pw_5_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv_pw_5_relu", "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv_pw_5_relu", "threshold": 0.0, "max_value": 6.0, "trainable": false}, "class_name": "ReLU"}, {"name": "conv_pad_6", "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "config": {"name": "conv_pad_6", "padding": [[0, 1], [0, 1]], "data_format": "channels_last", "trainable": false}, "class_name": "ZeroPadding2D"}, {"name": "conv_dw_6", "inbound_nodes": [[["conv_pad_6", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv_dw_6", "data_format": "channels_last", "depthwise_regularizer": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "depth_multiplier": 1, "bias_constraint": null, "activation": "linear", "strides": [2, 2], "trainable": false, "bias_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_6_bn", "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv_dw_6_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv_dw_6_relu", "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv_dw_6_relu", "threshold": 0.0, "max_value": 6.0, "trainable": false}, "class_name": "ReLU"}, {"name": "conv_pw_6", "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv_pw_6", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "bias_constraint": null, "filters": 512, "kernel_constraint": null, "activation": "linear", "strides": [1, 1], "trainable": false, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"name": "conv_pw_6_bn", "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv_pw_6_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv_pw_6_relu", "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv_pw_6_relu", "threshold": 0.0, "max_value": 6.0, "trainable": false}, "class_name": "ReLU"}, {"name": "conv_dw_7", "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv_dw_7", "data_format": "channels_last", "depthwise_regularizer": null, "activity_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "depth_multiplier": 1, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "trainable": false, "bias_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_7_bn", "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv_dw_7_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv_dw_7_relu", "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv_dw_7_relu", "threshold": 0.0, "max_value": 6.0, "trainable": false}, "class_name": "ReLU"}, {"name": "conv_pw_7", "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv_pw_7", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "bias_constraint": null, "filters": 512, "kernel_constraint": null, "activation": "linear", "strides": [1, 1], "trainable": false, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"name": "conv_pw_7_bn", "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv_pw_7_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv_pw_7_relu", "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv_pw_7_relu", "threshold": 0.0, "max_value": 6.0, "trainable": false}, "class_name": "ReLU"}, {"name": "conv_dw_8", "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv_dw_8", "data_format": "channels_last", "depthwise_regularizer": null, "activity_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "depth_multiplier": 1, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "trainable": false, "bias_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_8_bn", "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv_dw_8_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv_dw_8_relu", "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv_dw_8_relu", "threshold": 0.0, "max_value": 6.0, "trainable": false}, "class_name": "ReLU"}, {"name": "conv_pw_8", "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv_pw_8", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "bias_constraint": null, "filters": 512, "kernel_constraint": null, "activation": "linear", "strides": [1, 1], "trainable": false, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"name": "conv_pw_8_bn", "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv_pw_8_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv_pw_8_relu", "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv_pw_8_relu", "threshold": 0.0, "max_value": 6.0, "trainable": false}, "class_name": "ReLU"}, {"name": "conv_dw_9", "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv_dw_9", "data_format": "channels_last", "depthwise_regularizer": null, "activity_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "depth_multiplier": 1, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "trainable": false, "bias_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_9_bn", "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv_dw_9_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv_dw_9_relu", "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv_dw_9_relu", "threshold": 0.0, "max_value": 6.0, "trainable": false}, "class_name": "ReLU"}, {"name": "conv_pw_9", "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv_pw_9", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "bias_constraint": null, "filters": 512, "kernel_constraint": null, "activation": "linear", "strides": [1, 1], "trainable": false, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"name": "conv_pw_9_bn", "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv_pw_9_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv_pw_9_relu", "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv_pw_9_relu", "threshold": 0.0, "max_value": 6.0, "trainable": false}, "class_name": "ReLU"}, {"name": "conv_dw_10", "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv_dw_10", "data_format": "channels_last", "depthwise_regularizer": null, "activity_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "depth_multiplier": 1, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "trainable": false, "bias_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_10_bn", "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv_dw_10_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv_dw_10_relu", "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv_dw_10_relu", "threshold": 0.0, "max_value": 6.0, "trainable": false}, "class_name": "ReLU"}, {"name": "conv_pw_10", "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv_pw_10", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "bias_constraint": null, "filters": 512, "kernel_constraint": null, "activation": "linear", "strides": [1, 1], "trainable": false, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"name": "conv_pw_10_bn", "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv_pw_10_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv_pw_10_relu", "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv_pw_10_relu", "threshold": 0.0, "max_value": 6.0, "trainable": false}, "class_name": "ReLU"}, {"name": "conv_dw_11", "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv_dw_11", "data_format": "channels_last", "depthwise_regularizer": null, "activity_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "depth_multiplier": 1, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "trainable": false, "bias_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_11_bn", "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv_dw_11_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv_dw_11_relu", "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv_dw_11_relu", "threshold": 0.0, "max_value": 6.0, "trainable": false}, "class_name": "ReLU"}, {"name": "conv_pw_11", "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv_pw_11", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "bias_constraint": null, "filters": 512, "kernel_constraint": null, "activation": "linear", "strides": [1, 1], "trainable": false, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"name": "conv_pw_11_bn", "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv_pw_11_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv_pw_11_relu", "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv_pw_11_relu", "threshold": 0.0, "max_value": 6.0, "trainable": false}, "class_name": "ReLU"}, {"name": "conv_pad_12", "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "config": {"name": "conv_pad_12", "padding": [[0, 1], [0, 1]], "data_format": "channels_last", "trainable": false}, "class_name": "ZeroPadding2D"}, {"name": "conv_dw_12", "inbound_nodes": [[["conv_pad_12", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv_dw_12", "data_format": "channels_last", "depthwise_regularizer": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "depth_multiplier": 1, "bias_constraint": null, "activation": "linear", "strides": [2, 2], "trainable": false, "bias_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_12_bn", "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv_dw_12_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv_dw_12_relu", "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv_dw_12_relu", "threshold": 0.0, "max_value": 6.0, "trainable": false}, "class_name": "ReLU"}, {"name": "conv_pw_12", "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv_pw_12", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "bias_constraint": null, "filters": 1024, "kernel_constraint": null, "activation": "linear", "strides": [1, 1], "trainable": false, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"name": "conv_pw_12_bn", "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv_pw_12_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv_pw_12_relu", "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv_pw_12_relu", "threshold": 0.0, "max_value": 6.0, "trainable": false}, "class_name": "ReLU"}, {"name": "conv_dw_13", "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv_dw_13", "data_format": "channels_last", "depthwise_regularizer": null, "activity_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "depth_multiplier": 1, "bias_constraint": null, "activation": "linear", "strides": [1, 1], "trainable": false, "bias_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_13_bn", "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv_dw_13_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv_dw_13_relu", "inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv_dw_13_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}, "class_name": "ReLU"}, {"name": "conv_pw_13", "inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "name": "conv_pw_13", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "bias_constraint": null, "filters": 1024, "kernel_constraint": null, "activation": "linear", "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"name": "conv_pw_13_bn", "inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "config": {"beta_constraint": null, "center": true, "name": "conv_pw_13_bn", "scale": true, "momentum": 0.99, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"name": "conv_pw_13_relu", "inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "config": {"negative_slope": 0.0, "name": "conv_pw_13_relu", "threshold": 0.0, "max_value": 6.0, "trainable": true}, "class_name": "ReLU"}], "output_layers": [["conv_pw_13_relu", 0, 0]]}, "class_name": "Model"}, {"config": {"name": "global_average_pooling2d_1", "data_format": "channels_last", "trainable": true}, "class_name": "GlobalAveragePooling2D"}, {"config": {"use_bias": true, "name": "dense_1", "units": 256, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"seed": null, "name": "dropout_1", "rate": 0.2, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"use_bias": true, "name": "dense_2", "units": 256, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"use_bias": true, "name": "dense_3", "units": 10, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "activation": "softmax", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}]}, "class_name": "Sequential"}, "backend": "tensorflow", "keras_version": "2.2.4"}, "weightsManifest": [{"paths": ["group1-shard1of4", "group1-shard2of4", "group1-shard3of4", "group1-shard4of4"], "weights": [{"name": "dense_1/kernel", "dtype": "float32", "shape": [1024, 256]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [256]}, {"name": "dense_2/kernel", "dtype": "float32", "shape": [256, 256]}, {"name": "dense_2/bias", "dtype": "float32", "shape": [256]}, {"name": "dense_3/kernel", "dtype": "float32", "shape": [256, 10]}, {"name": "dense_3/bias", "dtype": "float32", "shape": [10]}, {"name": "conv_pw_13/kernel", "dtype": "float32", "shape": [1, 1, 1024, 1024]}, {"name": "conv_pw_13_bn/gamma", "dtype": "float32", "shape": [1024]}, {"name": "conv_pw_13_bn/beta", "dtype": "float32", "shape": [1024]}, {"name": "conv1/kernel", "dtype": "float32", "shape": [3, 3, 3, 32]}, {"name": "conv1_bn/gamma", "dtype": "float32", "shape": [32]}, {"name": "conv1_bn/beta", "dtype": "float32", "shape": [32]}, {"name": "conv1_bn/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "conv1_bn/moving_variance", "dtype": "float32", "shape": [32]}, {"name": "conv_dw_1/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 32, 1]}, {"name": "conv_dw_1_bn/gamma", "dtype": "float32", "shape": [32]}, {"name": "conv_dw_1_bn/beta", "dtype": "float32", "shape": [32]}, {"name": "conv_dw_1_bn/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "conv_dw_1_bn/moving_variance", "dtype": "float32", "shape": [32]}, {"name": "conv_pw_1/kernel", "dtype": "float32", "shape": [1, 1, 32, 64]}, {"name": "conv_pw_1_bn/gamma", "dtype": "float32", "shape": [64]}, {"name": "conv_pw_1_bn/beta", "dtype": "float32", "shape": [64]}, {"name": "conv_pw_1_bn/moving_mean", "dtype": "float32", "shape": [64]}, {"name": "conv_pw_1_bn/moving_variance", "dtype": "float32", "shape": [64]}, {"name": "conv_dw_2/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 64, 1]}, {"name": "conv_dw_2_bn/gamma", "dtype": "float32", "shape": [64]}, {"name": "conv_dw_2_bn/beta", "dtype": "float32", "shape": [64]}, {"name": "conv_dw_2_bn/moving_mean", "dtype": "float32", "shape": [64]}, {"name": "conv_dw_2_bn/moving_variance", "dtype": "float32", "shape": [64]}, {"name": "conv_pw_2/kernel", "dtype": "float32", "shape": [1, 1, 64, 128]}, {"name": "conv_pw_2_bn/gamma", "dtype": "float32", "shape": [128]}, {"name": "conv_pw_2_bn/beta", "dtype": "float32", "shape": [128]}, {"name": "conv_pw_2_bn/moving_mean", "dtype": "float32", "shape": [128]}, {"name": "conv_pw_2_bn/moving_variance", "dtype": "float32", "shape": [128]}, {"name": "conv_dw_3/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 128, 1]}, {"name": "conv_dw_3_bn/gamma", "dtype": "float32", "shape": [128]}, {"name": "conv_dw_3_bn/beta", "dtype": "float32", "shape": [128]}, {"name": "conv_dw_3_bn/moving_mean", "dtype": "float32", "shape": [128]}, {"name": "conv_dw_3_bn/moving_variance", "dtype": "float32", "shape": [128]}, {"name": "conv_pw_3/kernel", "dtype": "float32", "shape": [1, 1, 128, 128]}, {"name": "conv_pw_3_bn/gamma", "dtype": "float32", "shape": [128]}, {"name": "conv_pw_3_bn/beta", "dtype": "float32", "shape": [128]}, {"name": "conv_pw_3_bn/moving_mean", "dtype": "float32", "shape": [128]}, {"name": "conv_pw_3_bn/moving_variance", "dtype": "float32", "shape": [128]}, {"name": "conv_dw_4/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 128, 1]}, {"name": "conv_dw_4_bn/gamma", "dtype": "float32", "shape": [128]}, {"name": "conv_dw_4_bn/beta", "dtype": "float32", "shape": [128]}, {"name": "conv_dw_4_bn/moving_mean", "dtype": "float32", "shape": [128]}, {"name": "conv_dw_4_bn/moving_variance", "dtype": "float32", "shape": [128]}, {"name": "conv_pw_4/kernel", "dtype": "float32", "shape": [1, 1, 128, 256]}, {"name": "conv_pw_4_bn/gamma", "dtype": "float32", "shape": [256]}, {"name": "conv_pw_4_bn/beta", "dtype": "float32", "shape": [256]}, {"name": "conv_pw_4_bn/moving_mean", "dtype": "float32", "shape": [256]}, {"name": "conv_pw_4_bn/moving_variance", "dtype": "float32", "shape": [256]}, {"name": "conv_dw_5/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 256, 1]}, {"name": "conv_dw_5_bn/gamma", "dtype": "float32", "shape": [256]}, {"name": "conv_dw_5_bn/beta", "dtype": "float32", "shape": [256]}, {"name": "conv_dw_5_bn/moving_mean", "dtype": "float32", "shape": [256]}, {"name": "conv_dw_5_bn/moving_variance", "dtype": "float32", "shape": [256]}, {"name": "conv_pw_5/kernel", "dtype": "float32", "shape": [1, 1, 256, 256]}, {"name": "conv_pw_5_bn/gamma", "dtype": "float32", "shape": [256]}, {"name": "conv_pw_5_bn/beta", "dtype": "float32", "shape": [256]}, {"name": "conv_pw_5_bn/moving_mean", "dtype": "float32", "shape": [256]}, {"name": "conv_pw_5_bn/moving_variance", "dtype": "float32", "shape": [256]}, {"name": "conv_dw_6/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 256, 1]}, {"name": "conv_dw_6_bn/gamma", "dtype": "float32", "shape": [256]}, {"name": "conv_dw_6_bn/beta", "dtype": "float32", "shape": [256]}, {"name": "conv_dw_6_bn/moving_mean", "dtype": "float32", "shape": [256]}, {"name": "conv_dw_6_bn/moving_variance", "dtype": "float32", "shape": [256]}, {"name": "conv_pw_6/kernel", "dtype": "float32", "shape": [1, 1, 256, 512]}, {"name": "conv_pw_6_bn/gamma", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_6_bn/beta", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_6_bn/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_6_bn/moving_variance", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_7/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 512, 1]}, {"name": "conv_dw_7_bn/gamma", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_7_bn/beta", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_7_bn/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_7_bn/moving_variance", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_7/kernel", "dtype": "float32", "shape": [1, 1, 512, 512]}, {"name": "conv_pw_7_bn/gamma", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_7_bn/beta", "dtype": "float32", "shape": [512]}, {"name": 