{"weightsManifest": [{"weights": [{"dtype": "float32", "name": "conv2d_1_1/kernel", "shape": [3, 3, 1, 64]}, {"dtype": "float32", "name": "conv2d_1_1/bias", "shape": [64]}, {"dtype": "float32", "name": "conv2d_10_1/kernel", "shape": [3, 3, 256, 128]}, {"dtype": "float32", "name": "conv2d_10_1/bias", "shape": [128]}, {"dtype": "float32", "name": "conv2d_11_1/kernel", "shape": [3, 3, 128, 64]}, {"dtype": "float32", "name": "conv2d_11_1/bias", "shape": [64]}, {"dtype": "float32", "name": "conv2d_12_1/kernel", "shape": [3, 3, 64, 32]}, {"dtype": "float32", "name": "conv2d_12_1/bias", "shape": [32]}, {"dtype": "float32", "name": "conv2d_13_1/kernel", "shape": [3, 3, 32, 16]}, {"dtype": "float32", "name": "conv2d_13_1/bias", "shape": [16]}, {"dtype": "float32", "name": "conv2d_14_1/kernel", "shape": [3, 3, 16, 2]}, {"dtype": "float32", "name": "conv2d_14_1/bias", "shape": [2]}, {"dtype": "float32", "name": "conv2d_2_1/kernel", "shape": [3, 3, 64, 128]}, {"dtype": "float32", "name": "conv2d_2_1/bias", "shape": [128]}, {"dtype": "float32", "name": "conv2d_3_1/kernel", "shape": [3, 3, 128, 128]}, {"dtype": "float32", "name": "conv2d_3_1/bias", "shape": [128]}, {"dtype": "float32", "name": "conv2d_4_1/kernel", "shape": [3, 3, 128, 256]}, {"dtype": "float32", "name": "conv2d_4_1/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_5_1/kernel", "shape": [3, 3, 256, 256]}, {"dtype": "float32", "name": "conv2d_5_1/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_6_1/kernel", "shape": [3, 3, 256, 512]}, {"dtype": "float32", "name": "conv2d_6_1/bias", "shape": [512]}, {"dtype": "float32", "name": "conv2d_7_1/kernel", "shape": [3, 3, 512, 512]}, {"dtype": "float32", "name": "conv2d_7_1/bias", "shape": [512]}, {"dtype": "float32", "name": "conv2d_8_1/kernel", "shape": [3, 3, 512, 256]}, {"dtype": "float32", "name": "conv2d_8_1/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_9_1/kernel", "shape": [1, 1, 1256, 256]}, {"dtype": "float32", "name": "conv2d_9_1/bias", "shape": [256]}], "paths": ["group1-shard1of7", "group1-shard2of7", "group1-shard3of7", "group1-shard4of7", "group1-shard5of7", "group1-shard6of7", "group1-shard7of7"]}], "modelTopology": {"model_config": {"class_name": "Model", "config": {"input_layers": [["input_2", 0, 0], ["input_1", 0, 0]], "output_layers": [["up_sampling2d_3", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_2", "config": {"batch_input_shape": [null, 256, 256, 1], "dtype": "float32", "name": "input_2", "sparse": false}}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1", "config": {"filters": 64, "strides": [2, 2], "trainable": true, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_1", "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2", "config": {"filters": 128, "strides": [1, 1], "trainable": true, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_2", "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3", "config": {"filters": 128, "strides": [2, 2], "trainable": true, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_3", "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4", "config": {"filters": 256, "strides": [1, 1], "trainable": true, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_4", "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5", "config": {"filters": 256, "strides": [2, 2], "trainable": true, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_5", "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_6", "config": {"filters": 512, "strides": [1, 1], "trainable": true, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_6", "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 1000], "dtype": "float32", "name": "input_1", "sparse": false}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_7", "config": {"filters": 512, "strides": [1, 1], "trainable": true, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_7", "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "RepeatVector", "name": "repeat_vector_1", "config": {"name": "repeat_vector_1", "trainable": true, "n": 1024}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_8", "config": {"filters": 256, "strides": [1, 1], "trainable": true, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_8", "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null}}, {"inbound_nodes": [[["repeat_vector_1", 0, 0, {}]]], "class_name": "Reshape", "name": "reshape_1", "config": {"trainable": true, "name": "reshape_1", "target_shape": [32, 32, 1000]}}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}], ["reshape_1", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_1", "config": {"axis": 3, "name": "concatenate_1", "trainable": true}}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_9", "config": {"filters": 256, "strides": [1, 1], "trainable": true, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_9", "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_10", "config": {"filters": 128, "strides": [1, 1], "trainable": true, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_10", "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_1", "config": {"size": [2, 2], "name": "up_sampling2d_1", "trainable": true, "data_format": "channels_last"}}, {"inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_11", "config": {"filters": 64, "strides": [1, 1], "trainable": true, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_11", "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_2", "config": {"size": [2, 2], "name": "up_sampling2d_2", "trainable": true, "data_format": "channels_last"}}, {"inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_12", "config": {"filters": 32, "strides": [1, 1], "trainable": true, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_12", "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_13", "config": {"filters": 16, "strides": [1, 1], "trainable": true, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_13", "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_14", "config": {"filters": 2, "strides": [1, 1], "trainable": true, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_14", "kernel_regularizer": null, "activity_regularizer": null, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_3", "config": {"size": [2, 2], "name": "up_sampling2d_3", "trainable": true, "data_format": "channels_last"}}]}}, "keras_version": "2.2.2", "training_config": {"metrics": [], "sample_weight_mode": null, "loss_weights": null, "loss": "mse", "optimizer_config": {"class_name": "Adam", "config": {"amsgrad": false, "lr": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "epsilon": 1e-07, "beta_2": 0.9990000128746033}}}, "backend": "tensorflow"}}